sdaiIsSDAISubtypeOfBN(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Determines whether a specified SDAI data type is a subtype of another SDAI data type (supertype).
\param schemaName [in] A string that contains the name of the schema.
\param subName    [in] A string that contains the name of the SDAI data type to be checked.
\param superName  [in] A string that contains the name of the supertype.
\returns sdaiTRUE if the specified SDAI data type is a subtype of the specified supertype; otherwise, the function returns sdaiFALSE.